app/controllers/api/posts_controller.rb

  def index
    @posts = City.find(params:city_id).posts
---
SELECT "posts".* FROM "posts" WHERE "posts"."city_id" = $1  [["city_id", 6]]
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def create
    @city = City.find(params[:city_id])
    @post = @city.posts.create!(post_params)
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
INSERT INTO "posts" ("city_id", "user_id", "title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    @post = Post.find(params[:id])
    @post.update!(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "posts"."id" = $4  [["title", "asdf"], ["body", "asdfasdf"], ["updated_at", "2018-07-18 21:18:31.596117"], ["id", 16]]

  def destroy
    @post = City.find(params[:city_id]).posts.find(params[:id]).destroy
---
SELECT  "cities".* FROM "cities" WHERE "cities"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]